
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	ОбслуживаниеКлиентов = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода, КонецПериода);
	
	ОбновитьПланировщикНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПланировщикНаСервере()
	
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	
	Планировщик.Элементы.Очистить();
	
	ОбслуживаниеКлиентов = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода, КонецПериода);
	
	Пока ОбслуживаниеКлиентов.Следующий() Цикл
		
		НачалоОбслуживание = ОбслуживаниеКлиентов.ДатаПроведенияРабот + 
		(Час(ОбслуживаниеКлиентов.ВремяНачалаРаботПлан) * 60 * 60 + Минута(ОбслуживаниеКлиентов.ВремяНачалаРаботПлан) * 60);
		КонецОбслуживание = ОбслуживаниеКлиентов.ДатаПроведенияРабот + 
		(Час(ОбслуживаниеКлиентов.ВремяОкончанияРаботПлан) * 60 * 60 + Минута(ОбслуживаниеКлиентов.ВремяОкончанияРаботПлан) * 60);
		
		ЭлементПланировщика = Планировщик.Элементы.Добавить(НачалоОбслуживание, КонецОбслуживание);
		ЭлементПланировщика.Значение = ОбслуживаниеКлиентов.Ссылка;
		ЭлементПланировщика.Текст = ОбслуживаниеКлиентов.Специалист;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКалендарь(Команда)
	
	ОбновитьПланировщикНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", Дата(Начало));
	ЗначенияЗаполнения.Вставить("ВремяНачалаРаботПлан", Дата(Начало));
	ЗначенияЗаполнения.Вставить("ВремяОкончанияРаботПлан", Дата(Конец));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВКМ_ОбслуживаниеКлиента" Тогда
		
		ОбновитьПланировщикНаСервере(); 
		
	КонецЕсли;
	
КонецПроцедуры



