
Функция ЗаполнитьНаСервере(Параметры, АдресРезультата) Экспорт 
	
	НачалоПериода = НачалоМесяца(Дата(Параметры.Период));
	КонецПериода = КонецМесяца(Дата(Параметры.Период));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	ДоговорыКонтрагентов.Ссылка КАК Договор
					|ПОМЕСТИТЬ втДоговоры
					|ИЗ
					|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
					|ГДЕ
					|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
					|	И &ДатаЗапроса МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	РеализацияТоваровУслуг.Договор.Ссылка КАК Реализации
					|ПОМЕСТИТЬ втРеализации
					|ИЗ
					|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					|ГДЕ
					|	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
					|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
					|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	втДоговоры.Договор.Ссылка КАК ДоговорСсылка
					|ИЗ
					|	втДоговоры КАК втДоговоры
					|		ЛЕВОЕ СОЕДИНЕНИЕ втРеализации КАК втРеализации
					|		ПО (втРеализации.Реализации.Ссылка = втДоговоры.Договор.Ссылка)
					|ГДЕ
					|	втРеализации.Реализации.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ДатаЗапроса", НачалоПериода);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	ВсегоДокументов = Выборка.Количество();
	ТекДок = 0;
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
	
			Для каждого ЭлементВыборка Из Выборка Цикл
				
				НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				НовыйДокумент.Контрагент = ЭлементВыборка.ДоговорСсылка.Владелец;
				НовыйДокумент.Договор = ЭлементВыборка.ДоговорСсылка.Ссылка;
				НовыйДокумент.Организация = ЭлементВыборка.ДоговорСсылка.Организация;
				НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				НовыйДокумент.Дата = КонецПериода;
				НовыйДокумент.ВыполнитьАвтозаполнение();
				
				Если ЗначениеЗаполнено(НовыйДокумент.Услуги) Тогда
					
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
					//тчДокументы = Параметры.Объект.ДокументыЗаПериод.Добавить();
					//тчДокументы.Договор = НовыйДокумент.Договор.Ссылка;
					//тчДокументы.ДокументРеализация = НовыйДокумент.Ссылка;
					
				Иначе 
					Клиент = НовыйДокумент.Контрагент;
					Договор = НовыйДокумент.Договор;
					ТекстСообщения = СтрШаблон("Клиенту %1 по договору %2 за %3 услуг не предоставлялось",
					Клиент, Договор, Формат(КонецПериода, "ДФ='MMMM yyyy'"));
					
					Возврат ТекстСообщения;
					
				КонецЕсли;
				
				ПроцентВыполнения = (ТекДок/ВсегоДокументов)*100;
				ПроцентВыполнения = Окр(ПроцентВыполнения,0);
				
				//МассивВозврат.Добавить(ПроцентВыполнения);
				
				// сообщаем "процент" и "текст сообщения"
				ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения);
				
				ТекДок = ТекДок + 1;
				
				
			КонецЦикла;
			
			ТекстСообщения = "Создано" + ВсегоДокументов + "документов";
			Возврат ТекстСообщения;
		
	Иначе
		
		ТекстСообщения = "За указанный период документы уже созданы";
		Возврат ТекстСообщения;
		
	КонецЕсли;
	
КонецФункции
